_posts/PythonOnEmacs.org
* Emacs에서 Python mode setting<2009-09-02 Wed 18:22> 		   :emacs:python:

Emacs 23에 emacs에서 built-in으로 존재하는 python.el과 Python Distribution에서 배포 중인 python-mode.el 모드
두개가 존재한다. EmacsWiki와 mailing list에 한참 두개를 통합하자는 논의가 있었는데 결론이 아직 안 난듯하다. 
License issue로 한참 이야기 중이던데, 최근 받아본 python-mode.el은 GPL v3.0으로 되어 있는걸 보면 해결 기미가
보이는 것 같기도 하다. 

결론적으로는 python-mode.el과 ipython을 사용하기로 했다. 아직 todo로 pdb와 ropemacs 세팅이 남아
있는데 당분간은 이대로 써야겠다.

#+BEGIN_SRC elisp
;; python mode
(load "python-mode" nil t)
(autoload 'python-mode "python-mode" "Python editing mode." t)

(setq auto-mode-alist (cons '("\\.py$" . python-mode) auto-mode-alist))
(setq interpreter-mode-alist (cons '("python" . python-mode)
                                      interpreter-mode-alist))
(autoload 'python-mode "python" "Python editing mode." t)
(setq python-mode-hook
	  '(lambda () (progn
					(set-variable 'py-indent-offset 4)
					(set-variable 'py-smart-indentation nil)
                    ; python mode에서는 tab대신 space를
					(set-variable 'indent-tabs-mode nil) 
					(eldoc-mode 1))))

;; iPython settting
(setq ipython-command "/opt/local/bin/ipython2.5")
(require 'ipython)
#+END_SRC

- 5.1.0 버젼의 python-mode.el에는 triple quote(""")에 대한 font-lock에 문제가 있다. 메일링리스트에서
  패치를 찾아서 [[http://github.com/jmjeong/my-dot-emacs/blob/130e8d593cc49ca5e5d62d5b4fdb4c79c24aea90/python-mode.el][적용]]하여 해결했다. (<2009-09-10 Thu>)
